# HvacEnergy Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..HvacEnergy Property
SpecTypeId Class See Also
---
Energy, in discipline Energy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId HvacEnergy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HvacEnergy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HvacEnergy {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace